modules/testsuite/native-tests/src/test/resources/jaxrpc/wsse/interop/microsoft-wse.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-3e78d831-953a-4456-b97e-361557923f5a"></wsa:Action><wsa:MessageID wsu:Id="Id-f493e460-9a8b-4d72-9cbe-31c93b47354a">uuid:68a732d8-b630-4ded-bef0-9b83e735e0c7</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-c963012b-5cce-4144-a80a-eeeeacbfa741"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-6437041e-e761-4053-8ae2-7c5439108764">http://draught:8081/jbossws-jaxrpc-jse</wsa:To><wsse:Security soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-9e3e6632-f2a1-4b26-a682-9301a75003a7"><wsu:Created>2005-09-26T22:17:32Z</wsu:Created><wsu:Expires>2005-09-26T22:22:32Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-90d5d4da-8eb8-4deb-b087-395105f8f6ea">MIIBxDCCAW6gAwIBAgIQxUSXFzWJYYtOZnmmuOMKkjANBgkqhkiG9w0BAQQFADAWMRQwEgYDVQQDEwtSb290IEFnZW5jeTAeFw0wMzA3MDgxODQ3NTlaFw0zOTEyMzEyMzU5NTlaMB8xHTAbBgNVBAMTFFdTRTJRdWlja1N0YXJ0Q2xpZW50MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC+L6aB9x928noY4+0QBsXnxkQE4quJl7c3PUPdVu7k9A02hRG481XIfWhrDY5i7OEB7KGW7qFJotLLeMec/UkKUwCgv3VvJrs2nE9xO3SSWIdNzADukYh+Cxt+FUU6tUkDeqg7dqwivOXhuOTRyOI3HqbWTbumaLdc8jufz2LhaQIDAQABo0swSTBHBgNVHQEEQDA+gBAS5AktBh0dTwCNYSHcFmRjoRgwFjEUMBIGA1UEAxMLUm9vdCBBZ2VuY3mCEAY3bACqAGSKEc+41KpcNfQwDQYJKoZIhvcNAQEEBQADQQAfIbnMPVYkNNfX1tG1F+qfLhHwJdfDUZuPyRPucWF5qkh6sSdWVBY5sT/txBnVJGziyO8DPYdu2fPMER8ajJfl</wsse:BinarySecurityToken><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" /><KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">rN1aYF3swPMR6YQ3ocxch6pK3zo=</wsse:KeyIdentifier></wsse:SecurityTokenReference></KeyInfo><xenc:CipherData><xenc:CipherValue>y414gRy4mHK+XiKD7Lj+87ZFE/zH+mulqlBViLnWaYHq5JK+grt1PuKSj9fstOXFzaRUj1nZBVL5r7eDuEyf1YsD0ySf4bvjvPk802elzs7RDDTI/7Nng0QmTKoLM7fkINR6cVd1diXXAscLMbALtkGm8oSBG5iCaXCAXUcZjoG0yz58E1xR7ck0uSyd1sLQVGUK0GEsTUnUj8Neu819UNWBdX8OggJD5GSPidXE3B3LE7JJyNAy2Nu+A081XVd59poa9/2g9VhxEqpEb4EgtBt1DulshEo3WtL9yVRIlFgykil4nLP1UaM7qO8Z6fvQVa8oSIeySph94s2xZvoUmw==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#EncryptedContent-0810909e-8198-4b19-a4bc-e81d84c6e9cb" /></xenc:ReferenceList></xenc:EncryptedKey><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-3e78d831-953a-4456-b97e-361557923f5a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>qzwAeBclH9e04UeQehmFjVFNMTs=</DigestValue></Reference><Reference URI="#Id-f493e460-9a8b-4d72-9cbe-31c93b47354a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>kr8F6ybX275vDLh4u50cm1317TY=</DigestValue></Reference><Reference URI="#Id-c963012b-5cce-4144-a80a-eeeeacbfa741"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>eTRvqYkJqEStNIJihV8BFCuCSx0=</DigestValue></Reference><Reference URI="#Id-6437041e-e761-4053-8ae2-7c5439108764"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>Mc/Py9DTRBm0rlzUn7nSbLmIFE0=</DigestValue></Reference><Reference URI="#Timestamp-9e3e6632-f2a1-4b26-a682-9301a75003a7"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>SqkivGZafBC0g3afg6Xu9vPxih8=</DigestValue></Reference><Reference URI="#Id-4acb2491-8ec7-4f92-9547-ac52f9032277"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>VPZKXJgUxE2mpHLTjveTWkXA1Jo=</DigestValue></Reference></SignedInfo><SignatureValue>KPgfLB6vlsmD7ShsZ2v09tmjOcQqp6n0R7jMDo5WomGAPk01DX8hBjWEfBMt94k9tDlWAQ+lTzh8ydZWppQ5q1ZI6AKIkw24KINzUnAq63rZshtZjz7AW6uOC0ypS8rI1hQAoIb9pjZUb2nNP8etNUPEKThMfew2t3ZvtCSyYAo=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-90d5d4da-8eb8-4deb-b087-395105f8f6ea" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-4acb2491-8ec7-4f92-9547-ac52f9032277"><xenc:EncryptedData Id="EncryptedContent-0810909e-8198-4b19-a4bc-e81d84c6e9cb" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" /><xenc:CipherData><xenc:CipherValue>rcPPs1DlqKQuZOxdEbH8I3B5GaFgVksz4PQaoEl88hgQcxhTz3/y+J86F4Tf5PGLmSJQlOloMWe2SmqrdWYiRPyEqpRCb4o24jYIkZQxuK7qiDCdsueH0EX+sUB0hl0c0leTEeJQFmN5bv3gJ2pxyN+zWfD5nW3kNteTec9jkowQEGg+lzHenb6Hqa53Rn+zeEXaPIdmLCa+ZeqNMWf7eA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>
